const newsArray = [
  {
    id: "1",
    image: "/images/TarasShevchenkoUniversity.png",
    title: "Київський університет відкрив нову лабораторію для дослідження штучного інтелекту",
    description: "Київський національний університет імені Тараса Шевченка відкрив нову сучасну лабораторію, спеціально орієнтовану на дослідження штучного інтелекту. Лабораторія оснащена останніми технологіями, включаючи потужні сервери для тренування моделей глибокого навчання, а також інтерактивні платформи для досліджень у галузі машинного навчання, комп'ютерного зору та природної обробки мови. Студенти та дослідники зможуть працювати над реальними проектами, спрямованими на створення нових алгоритмів для медицини, фінансів та промисловості. У лабораторії також будуть проводитися курси для студентів різних спеціальностей, зокрема з інженерії програмного забезпечення, робототехніки та автоматизації."
  },
  {
    id: "2",
    image: "/images/LvivPolytechnicUniversity.jpg",
    title: "Львівська політехніка запускає нову програму для студентів з робототехніки",
    description: "Львівська політехніка анонсувала запуск нової магістерської програми, яка охоплює всі аспекти робототехніки та автоматизації. Програма включає теоретичні курси з роботизованих систем, обробки сигналів, алгоритмів штучного інтелекту та машинного навчання, а також практичні лабораторні роботи, в яких студенти будуть створювати автономних роботів та працювати з інтеграцією сенсорних систем. У рамках програми також передбачено стажування в провідних технологічних компаніях, де студенти зможуть застосувати набуті знання у реальних проектах та дослідницьких роботах."
  },
  {
    id: "3",
    image: "/images/OdesaMechnikovUniversity.jpg",
    title: "Одеситів здивували студенти з Харківського університету на міжнародній конференції",
    description: "Студенти Харківського національного університету продемонстрували свої дослідження на міжнародній конференції, що відбулася в Одесі. Їхні роботи, які стосуються новітніх екологічних технологій, включали дослідження ефективності використання відновлюваних джерел енергії, розробки в області переробки відходів, а також створення інтелектуальних систем для збереження природних ресурсів. Один з проектів, розроблений студентами університету, пропонує нові методи збору та обробки даних для прогнозування зміни клімату, що вже викликало великий інтерес серед міжнародних експертів та науковців. Конференція також стала місцем для налагодження співпраці між молодими науковцями та провідними університетами світу."
  },
  {
    id: "4",
    image: "/images/Shev.jpg",
    title: "Університет Шевченка запускає програму для стартапів у галузі медичних технологій",
    description: "Київський університет імені Тараса Шевченка оголосив про відкриття нової програми для підтримки стартапів у сфері медичних технологій. У рамках цієї програми, студенти та молоді підприємці зможуть розробляти інноваційні технології для діагностики, лікування та реабілітації. Програма включає менторство від провідних лікарів, дослідників та підприємців у сфері охорони здоров'я, а також можливість отримати фінансування для реалізації проектів. Однією з ключових складових програми є створення стартап-акселератора, який допоможе учасникам втілювати ідеї в життя, працюючи з реальними медичними закладами."
  },
  {
    id: "5",
    image: "/images/Cher.webp",
    title: "Чернівецький університет представив новий курс з цифрової економіки",
    description: "Чернівецький національний університет запустив новий курс для студентів, що охоплює всі аспекти цифрової економіки, включаючи електронну комерцію, блокчейн технології, криптовалюти та цифрові платформи. Курс охоплює як теоретичні основи, так і практичні навички, необхідні для роботи в сучасній цифровій економіці. Студенти вивчатимуть, як побудувати ефективні бізнес-моделі в Інтернеті, як безпечно здійснювати фінансові транзакції через цифрові платформи, а також як розвивати стартапи в умовах високої конкуренції на цифровому ринку. Курс включає також навчальні модулі, що стосуються захисту даних та безпеки в Інтернеті."
  },
  {
    id: "6",
    image: "/images/Ternopil.jpg",
    title: "Тернопільський університет отримав грант для розвитку досліджень в аграрній сфері",
    description: "Тернопільський національний університет отримав грант від міжнародних фондів на розвиток наукових досліджень в аграрній сфері. Кошти будуть спрямовані на розробку нових технологій для покращення якості сільськогосподарських продуктів, зокрема зосереджуючись на інноваціях в галузі аграрної біотехнології, стійких до кліматичних змін культур, а також ефективних методах управління водними ресурсами. В університеті створено нову дослідницьку лабораторію, яка буде проводити дослідження в галузі агрономії, екології та харчових технологій, а також проводити тренінги та практичні заняття для студентів і фахівців аграрної сфери."
  },
  {
    id: "7",
    image: "/images/Dnipro.jpg",
    title: "Дніпровський університет започаткував програму обміну для студентів з Європою",
    description: "Дніпропетровський національний університет оголосив про запуск нової програми обміну для студентів з університетами Європи. Програма дозволить студентам пройти семестрові стажування та навчання в університетах Німеччини, Франції, Італії та Польщі. Програма включає в себе різноманітні напрямки, такі як інженерія, економіка, інформаційні технології та екологія. Студенти будуть мати можливість не тільки здобути знання, але й познайомитись з культурою та традиціями європейських країн. Цей проект сприятиме розвитку міжнародних зв'язків та зміцненню співпраці в галузі освіти та науки."
  },
  {
    id: "8",
    image: "/images/KievPolite.jpg",
    title: "Київський політех відкриває інноваційний центр для стартапів в сфері екології",
    description: "Київський політехнічний університет відкрив інноваційний центр для стартапів, що спеціалізуються на екологічних технологіях. Центр надаватиме молодим підприємцям і дослідникам можливість розробляти та тестувати інноваційні рішення в таких напрямках, як очищення води, утилізація відходів, зниження викидів CO2 та створення енергоефективних систем. Центр також співпрацюватиме з міжнародними екологічними організаціями та інвесторами, що дозволить стартапам отримувати фінансування для реалізації своїх проектів та запуску їх у виробництво."
  },
  {
    id: "9",
    image: "/images/Lviv.jpg",
    title: "Національний університет ім. Івана Франка започаткував програму з кібербезпеки",
    description: "Національний університет імені Івана Франка в Львові запустив нову програму навчання з кібербезпеки, яка охоплює такі аспекти, як захист інформаційних систем, криптографія, етичний хакінг та управління ризиками. Студенти програми будуть вивчати, як захищати великі корпоративні системи від кіберзагроз, а також як створювати захищені програмні продукти. Окрему увагу буде приділено новітнім методам боротьби з кіберзлочинністю, а також вивченню сучасних стандартів захисту даних, що є необхідними для роботи в умовах глобальної цифрової трансформації."
  },
  {
    id: "10",
    image: "/images/Zapo.jpg",
    title: "Запорізький університет відкрив кафедру для досліджень у галузі 3D-друку",
    description: "Запорізький національний університет оголосив про відкриття нової кафедри, що спеціалізується на дослідженнях у галузі 3D-друку. Студенти кафедри будуть вивчати всі аспекти цієї технології, від створення моделей до застосування в різних сферах, таких як медицина, промисловість, архітектура та навіть космічні технології. У межах програми студенти зможуть працювати з сучасними 3D-принтерами, вивчати новітні методи матеріалознавства та досліджувати перспективи використання 3D-друку для вирішення глобальних проблем, таких як стійкість до змін клімату."
  }
]

const contTransitions = document.getElementById("contTransitions")

function transitions(){
  const ol = document.createElement("ol")
  for(tran of newsArray){
    const li = document.createElement("li")
    const a = document.createElement("a")

    a.innerText = tran.title
    a.href = `#${tran.id}`

    li.append(a)
    ol.append(li)
  }

  contTransitions.append(ol)
}

transitions()

const contNews = document.getElementById("contNews")

function createNews(){
  for (const news of newsArray) {
    const div = document.createElement("div")
    div.classList.add("row", "gx-0", "gy-0")

    const h1 = document.createElement("h1")
    h1.innerText = news.title
    h1.id = news.id

    const img = document.createElement("img")
    img.src = news.image

    const p = document.createElement("p")
    p.innerText = news.description

    div.append(h1, img, p)
    contNews.append(div)
  }
}

createNews()